Revit 2024 API
Document.NewRooms2 Method
Overload List
Name | Description
NewRooms2(Level)
 Creates new rooms in each plan circuit found in the given level in the last phase.
NewRooms2(Level, Phase)
 Creates new rooms in each plan circuit found in the given level in the given phase.
NewRooms2(Phase, Int32)
 Creates new unplaced rooms in the given phase.
See Also
Document Class
Document Members
Autodesk.Revit.Creation Namespace